app/controllers/departments_controller.rb

SELECT  "departments".* FROM "departments"  WHERE "departments"."id" = $1 LIMIT 1  [["id", 59]]
SELECT "courses".* FROM "courses"  WHERE "courses"."department_id" = $1  [["department_id", 71]]
---
  def show
    @departments = Department.find(params[:id])
    @courses = Course.where(department_id: Department.find(params[:id]))