app/controllers/home_controller.rb

SELECT  "departments".* FROM "departments"  WHERE "departments"."role_department" = 'D_MECHE Mechanical Engineering' LIMIT 1
---
  def index
    #identify user
    @creds = request.env['eppn']
    @creds = ENV['eppn'] if !Rails.env.production?
    #look up roles
    roles = Roles.for(@creds)
    #see if they have access
    render :no_access if roles.count == 0

    #lookup their departments
    @departments = roles.map do |dept|
      Department.find_by_role_department(dept)